* emacs snippet
#+BEGIN_SRC emacs-lisp
(defun aod.meson/sources (dir regexp)
  (interactive "DDirectory:\nsRegexp: ")
  (message dir)
  (let* ((filenames (directory-files dir
				     t ; full path
				     regexp ;match
				     nil	;nosort
				     ))
	 (formatted (mapconcat (function (lambda (x)
					   (let ((relative-path (file-relative-name x ".")))
					     (format "'%s',\n" relative-path))))
			       filenames
			       " ")))
    (insert formatted)))
#+END_SRC

#+RESULTS:
: aod\.meson/sources

  - dired-mark-files-containing-regexp 
    cpp
  - =w= dired-copy-filename-as-killd
** <2020-06-03 Wed> not launching??
   on =IPlugAPP_main.cpp=
   - not defined =APP_ALLOW_MULTIPLE_INSTANCES=
   - =HANDLE hMutex = OpenMutex(MUTEX_ALL_ACCESS, 0, BUNDLE_NAME); // BUNDLE_NAME used because it won't have spaces in it= returns something..
   - so it tries to bring it to front..


   #+BEGIN_SRC sh
ps -W | grep -i iplug
   #+END_SRC

   #+RESULTS:
   : 74008       0       0       8472  ?              0 20:53:46 W:\dev\_tmp\mesonIPlug\examples\nogui01\buildvs\iplug_exe.exe


   Note: these are the collumns
   #+BEGIN_EXAMPLE
         PID    PPID    PGID     WINPID   TTY         UID    STIME COMMAND
   #+END_EXAMPLE

   #+BEGIN_SRC sh
taskkill //f //pid 8472
   #+END_SRC
